FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/can_reg.h
#define CAN_CON_CCE_Pos                  6                              /*!< CAN_T::CON: CCE Position  */
#define CAN_CON_CCE_Msk                  ( 0x1ul << CAN_CON_CCE_Pos )   /*!< CAN_T::CON: CCE Mask      */

#define CAN_CON_DAR_Pos                  5                              /*!< CAN_T::CON: DAR Position  */
#define CAN_CON_DAR_Msk                  ( 0x1ul << CAN_CON_DAR_Pos )   /*!< CAN_T::CON: DAR Mask      */

#define CAN_CON_EIE_Pos                  3                              /*!< CAN_T::CON: EIE Position  */
#define CAN_CON_EIE_Msk                  ( 0x1ul << CAN_CON_EIE_Pos )   /*!< CAN_T::CON: EIE Mask      */

#define CAN_CON_SIE_Pos                  2                              /*!< CAN_T::CON: SIE Position  */
#define CAN_CON_SIE_Msk                  ( 0x1ul << CAN_CON_SIE_Pos )   /*!< CAN_T::CON: SIE Mask      */

#define CAN_CON_IE_Pos                   1                              /*!< CAN_T::CON: IE Position   */
#define CAN_CON_IE_Msk                   ( 0x1ul << CAN_CON_IE_Pos )    /*!< CAN_T::CON: IE Mask       */

#define CAN_CON_INIT_Pos                 0                              /*!< CAN_T::CON: INIT Position */
#define CAN_CON_INIT_Msk                 ( 0x1ul << CAN_CON_INIT_Pos )  /*!< CAN_T::CON: INIT Mask     */

/* CAN STATUS Bit Field Definitions */
#define CAN_STATUS_BOFF_Pos              7                                 /*!< CAN_T::STATUS: BOFF Position  */
#define CAN_STATUS_BOFF_Msk              ( 0x1ul << CAN_STATUS_BOFF_Pos )  /*!< CAN_T::STATUS: BOFF Mask      */

#define CAN_STATUS_EWARN_Pos             6                                 /*!< CAN_T::STATUS: EWARN Position */
#define CAN_STATUS_EWARN_Msk             ( 0x1ul << CAN_STATUS_EWARN_Pos ) /*!< CAN_T::STATUS: EWARN Mask     */

#define CAN_STATUS_EPASS_Pos             5                                 /*!< CAN_T::STATUS: EPASS Position */
#define CAN_STATUS_EPASS_Msk             ( 0x1ul << CAN_STATUS_EPASS_Pos ) /*!< CAN_T::STATUS: EPASS Mask     */

#define CAN_STATUS_RXOK_Pos              4                                 /*!< CAN_T::STATUS: RXOK Position  */
#define CAN_STATUS_RXOK_Msk              ( 0x1ul << CAN_STATUS_RXOK_Pos )  /*!< CAN_T::STATUS: RXOK Mask      */

#define CAN_STATUS_TXOK_Pos              3                                 /*!< CAN_T::STATUS: TXOK Position  */
#define CAN_STATUS_TXOK_Msk              ( 0x1ul << CAN_STATUS_TXOK_Pos )  /*!< CAN_T::STATUS: TXOK Mask      */

#define CAN_STATUS_LEC_Pos               0                                 /*!< CAN_T::STATUS: LEC Position   */
#define CAN_STATUS_LEC_Msk               ( 0x7ul << CAN_STATUS_LEC_Pos )   /*!< CAN_T::STATUS: LEC Mask       */

/* CAN ERR Bit Field Definitions */
#define CAN_ERR_RP_Pos                   15                             /*!< CAN_T::ERR: RP Position       */
#define CAN_ERR_RP_Msk                   ( 0x1ul << CAN_ERR_RP_Pos )    /*!< CAN_T::ERR: RP Mask           */

#define CAN_ERR_REC_Pos                  8                              /*!< CAN_T::ERR: REC Position      */
#define CAN_ERR_REC_Msk                  ( 0x7Ful << CAN_ERR_REC_Pos )  /*!< CAN_T::ERR: REC Mask          */

#define CAN_ERR_TEC_Pos                  0                              /*!< CAN_T::ERR: TEC Position      */
#define CAN_ERR_TEC_Msk                  ( 0xFFul << CAN_ERR_TEC_Pos )  /*!< CAN_T::ERR: TEC Mask          */

/* CAN BTIME Bit Field Definitions */
#define CAN_BTIME_TSEG2_Pos              12                               /*!< CAN_T::BTIME: TSEG2 Position  */
#define CAN_BTIME_TSEG2_Msk              ( 0x7ul << CAN_BTIME_TSEG2_Pos ) /*!< CAN_T::BTIME: TSEG2 Mask      */

#define CAN_BTIME_TSEG1_Pos              8                                /*!< CAN_T::BTIME: TSEG1 Position  */
#define CAN_BTIME_TSEG1_Msk              ( 0xFul << CAN_BTIME_TSEG1_Pos ) /*!< CAN_T::BTIME: TSEG1 Mask      */

#define CAN_BTIME_SJW_Pos                6                                /*!< CAN_T::BTIME: SJW Position    */
#define CAN_BTIME_SJW_Msk                ( 0x3ul << CAN_BTIME_SJW_Pos )   /*!< CAN_T::BTIME: SJW Mask        */

#define CAN_BTIME_BRP_Pos                0                                /*!< CAN_T::BTIME: BRP Position    */
#define CAN_BTIME_BRP_Msk                ( 0x3Ful << CAN_BTIME_BRP_Pos )  /*!< CAN_T::BTIME: BRP Mask        */

/* CAN IIDR Bit Field Definitions */
#define CAN_IIDR_INTID_Pos               0                                  /*!< CAN_T::IIDR: INTID Position   */
#define CAN_IIDR_INTID_Msk               ( 0xFFFFul << CAN_IIDR_INTID_Pos ) /*!< CAN_T::IIDR: INTID Mask       */

/* CAN TEST Bit Field Definitions */
#define CAN_TEST_RX_Pos                  7                                /*!< CAN_T::TEST: RX Position      */
#define CAN_TEST_RX_Msk                  ( 0x1ul << CAN_TEST_RX_Pos )     /*!< CAN_T::TEST: RX Mask          */

#define CAN_TEST_TX_Pos                  5                                /*!< CAN_T::TEST: TX Position      */
#define CAN_TEST_TX_Msk                  ( 0x3ul << CAN_TEST_TX_Pos )     /*!< CAN_T::TEST: TX Mask          */

#define CAN_TEST_LBACK_Pos               4                                /*!< CAN_T::TEST: LBACK Position   */
#define CAN_TEST_LBACK_Msk               ( 0x1ul << CAN_TEST_LBACK_Pos )  /*!< CAN_T::TEST: LBACK Mask       */

#define CAN_TEST_SILENT_Pos              3                                /*!< CAN_T::TEST: Silent Position  */
#define CAN_TEST_SILENT_Msk              ( 0x1ul << CAN_TEST_SILENT_Pos ) /*!< CAN_T::TEST: Silent Mask      */

#define CAN_TEST_BASIC_Pos               2                                /*!< CAN_T::TEST: Basic Position   */
#define CAN_TEST_BASIC_Msk               ( 0x1ul << CAN_TEST_BASIC_Pos )  /*!< CAN_T::TEST: Basic Mask       */

/* CAN BPRE Bit Field Definitions */
#define CAN_BRPE_BRPE_Pos                0                              /*!< CAN_T::BRPE: BRPE Position    */
#define CAN_BRPE_BRPE_Msk                ( 0xFul << CAN_BRPE_BRPE_Pos ) /*!< CAN_T::BRPE: BRPE Mask        */

/* CAN IFn_CREQ Bit Field Definitions */
#define CAN_IF_CREQ_BUSY_Pos             15                                   /*!< CAN_IF_T::CREQ: BUSY Position */
#define CAN_IF_CREQ_BUSY_Msk             ( 0x1ul << CAN_IF_CREQ_BUSY_Pos )    /*!< CAN_IF_T::CREQ: BUSY Mask     */

#define CAN_IF_CREQ_MSGNUM_Pos           0                                    /*!< CAN_IF_T::CREQ: MSGNUM Position */
#define CAN_IF_CREQ_MSGNUM_Msk           ( 0x3Ful << CAN_IF_CREQ_MSGNUM_Pos ) /*!< CAN_IF_T::CREQ: MSGNUM Mask     */

/* CAN IFn_CMASK Bit Field Definitions */
#define CAN_IF_CMASK_WRRD_Pos            7                                          /*!< CAN_IF_T::CMASK: WRRD Position */
#define CAN_IF_CMASK_WRRD_Msk            ( 0x1ul << CAN_IF_CMASK_WRRD_Pos )         /*!< CAN_IF_T::CMASK: WRRD Mask     */

